atsamd-rs/atsamd/svd/ATSAMC20J18AU.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>CCL</name>
         <version>U22251.0.1</version>
         <description>Configurable Custom Logic</description>
         <groupName>CCL</groupName>
         <prependToName>CCL_</prependToName>
         <baseAddress>0x42005C00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x18</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTRL</name>
               <description>Control</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run during Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>1</dimIncrement>
               <name>SEQCTRL[%s]</name>
               <description>SEQ Control x</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SEQSEL</name>
                     <description>Sequential Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>SEQSELSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Sequential logic is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DFF</name>
                           <description>D flip flop</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>JK</name>
                           <description>JK flip flop</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LATCH</name>
                           <description>D latch</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RS</name>
                           <description>RS latch</description>
                           <value>4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>LUTCTRL[%s]</name>
               <description>LUT Control x</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>LUT Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FILTSEL</name>
                     <description>Filter Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>FILTSELSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Filter disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYNCH</name>
                           <description>Synchronizer enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FILTER</name>
                           <description>Filter enabled</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EDGESEL</name>
                     <description>Edge Selection</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INSEL0</name>
                     <description>Input Selection 0</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>INSEL0Select</name>
                        <enumeratedValue>
                           <name>MASK</name>
                           <description>Masked input</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FEEDBACK</name>
                           <description>Feedback input source</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LINK</name>
                           <description>Linked LUT input source</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVENT</name>
                           <description>Event in put source</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IO</name>
                           <description>I/O pin input source</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AC</name>
                           <description>AC input source</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC</name>
                           <description>TC input source</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALTTC</name>
                           <description>Alternate TC input source</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC</name>
                           <description>TCC input source</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM</name>
                           <description>SERCOM inout source</description>
                           <value>9</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INSEL1</name>
                     <description>Input Selection 1</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>INSEL2</name>
                     <description>Input Selection 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>INVEI</name>
                     <description>Input Event Invert</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LUTEI</name>
                     <description>Event Input Enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LUTEO</name>
                     <description>Event Output Enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRUTH</name>
                     <description>Truth Value</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
